STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231axx_ca35.h
/*******************  Bit definition for DMA_SMISR register  ****************/
#define DMA_SMISR_MIS0_Pos       (0U)
#define DMA_SMISR_MIS0_Msk       (0x1UL << DMA_SMISR_MIS0_Pos)                  /*!< 0x00000001 */
#define DMA_SMISR_MIS0           DMA_SMISR_MIS0_Msk                            /*!< Masked Interrupt State of Secure Channel 0 */
#define DMA_SMISR_MIS1_Pos       (1U)
#define DMA_SMISR_MIS1_Msk       (0x1UL << DMA_SMISR_MIS1_Pos)                  /*!< 0x00000002 */
#define DMA_SMISR_MIS1           DMA_SMISR_MIS1_Msk                            /*!< Masked Interrupt State of Secure Channel 1 */
#define DMA_SMISR_MIS2_Pos       (2U)
#define DMA_SMISR_MIS2_Msk       (0x1UL << DMA_SMISR_MIS2_Pos)                  /*!< 0x00000004 */
#define DMA_SMISR_MIS2           DMA_SMISR_MIS2_Msk                            /*!< Masked Interrupt State of Secure Channel 2 */
#define DMA_SMISR_MIS3_Pos       (3U)
#define DMA_SMISR_MIS3_Msk       (0x1UL << DMA_SMISR_MIS3_Pos)                  /*!< 0x00000008 */
#define DMA_SMISR_MIS3           DMA_SMISR_MIS3_Msk                            /*!< Masked Interrupt State of Secure Channel 3 */
#define DMA_SMISR_MIS4_Pos       (4U)
#define DMA_SMISR_MIS4_Msk       (0x1UL << DMA_SMISR_MIS4_Pos)                  /*!< 0x00000010 */
#define DMA_SMISR_MIS4           DMA_SMISR_MIS4_Msk                            /*!< Masked Interrupt State of Secure Channel 4 */
#define DMA_SMISR_MIS5_Pos       (5U)
#define DMA_SMISR_MIS5_Msk       (0x1UL << DMA_SMISR_MIS5_Pos)                  /*!< 0x00000020 */
#define DMA_SMISR_MIS5           DMA_SMISR_MIS5_Msk                            /*!< Masked Interrupt State of Secure Channel 5 */
#define DMA_SMISR_MIS6_Pos       (6U)
#define DMA_SMISR_MIS6_Msk       (0x1UL << DMA_SMISR_MIS6_Pos)                  /*!< 0x00000040 */
#define DMA_SMISR_MIS6           DMA_SMISR_MIS6_Msk                            /*!< Masked Interrupt State of Secure Channel 6 */
#define DMA_SMISR_MIS7_Pos       (7U)
#define DMA_SMISR_MIS7_Msk       (0x1UL << DMA_SMISR_MIS7_Pos)                  /*!< 0x00000080 */
#define DMA_SMISR_MIS7           DMA_SMISR_MIS7_Msk                            /*!< Masked Interrupt State of Secure Channel 7 */
#define DMA_SMISR_MIS8_Pos       (8U)
#define DMA_SMISR_MIS8_Msk       (0x1UL << DMA_SMISR_MIS8_Pos)                  /*!< 0x00000100 */
#define DMA_SMISR_MIS8           DMA_SMISR_MIS8_Msk                            /*!< Masked Interrupt State of Secure Channel 8 */
#define DMA_SMISR_MIS9_Pos       (9U)
#define DMA_SMISR_MIS9_Msk       (0x1UL << DMA_SMISR_MIS9_Pos)                  /*!< 0x00000200 */
#define DMA_SMISR_MIS9           DMA_SMISR_MIS9_Msk                            /*!< Masked Interrupt State of Secure Channel 9 */
#define DMA_SMISR_MIS10_Pos      (10U)
#define DMA_SMISR_MIS10_Msk      (0x1UL << DMA_SMISR_MIS10_Pos)                 /*!< 0x00000400 */
#define DMA_SMISR_MIS10          DMA_SMISR_MIS10_Msk                           /*!< Masked Interrupt State of Secure Channel 10 */
#define DMA_SMISR_MIS11_Pos      (11U)
#define DMA_SMISR_MIS11_Msk      (0x1UL << DMA_SMISR_MIS11_Pos)                 /*!< 0x00000800 */
#define DMA_SMISR_MIS11          DMA_SMISR_MIS11_Msk                           /*!< Masked Interrupt State of Secure Channel 11 */
#define DMA_SMISR_MIS12_Pos      (12U)
#define DMA_SMISR_MIS12_Msk      (0x1UL << DMA_SMISR_MIS12_Pos)                 /*!< 0x00001000 */
#define DMA_SMISR_MIS12          DMA_SMISR_MIS12_Msk                           /*!< Masked Interrupt State of Secure Channel 12 */
#define DMA_SMISR_MIS13_Pos      (13U)
#define DMA_SMISR_MIS13_Msk      (0x1UL << DMA_SMISR_MIS13_Pos)                 /*!< 0x00002000 */
#define DMA_SMISR_MIS13          DMA_SMISR_MIS13_Msk                           /*!< Masked Interrupt State of Secure Channel 13 */
#define DMA_SMISR_MIS14_Pos      (14U)
#define DMA_SMISR_MIS14_Msk      (0x1UL << DMA_SMISR_MIS14_Pos)                 /*!< 0x00004000 */
#define DMA_SMISR_MIS14          DMA_SMISR_MIS14_Msk                           /*!< Masked Interrupt State of Secure Channel 14 */
#define DMA_SMISR_MIS15_Pos      (15U)
#define DMA_SMISR_MIS15_Msk      (0x1UL << DMA_SMISR_MIS15_Pos)                 /*!< 0x00008000 */
#define DMA_SMISR_MIS15          DMA_SMISR_MIS14_Msk                           /*!< Masked Interrupt State of Secure Channel 15 */

/*******************  Bit definition for DMA_CLBAR register  ****************/
#define DMA_CLBAR_LBA_Pos         (16U)
#define DMA_CLBAR_LBA_Msk         (0xFFFFUL << DMA_CLBAR_LBA_Pos)               /*!< 0xFFFF0000 */
#define DMA_CLBAR_LBA             DMA_CLBAR_LBA_Msk                            /*!< Linked-list Base Address of DMA channel x */

/*******************  Bit definition for DMA_CCIDCFGR register  *******************/
#define DMA_CCIDCFGR_CFEN_Pos           (0U)
#define DMA_CCIDCFGR_CFEN_Msk           (0x1UL << DMA_CCIDCFGR_CFEN_Pos)         /*!< 0x00000001 */
#define DMA_CCIDCFGR_CFEN               DMA_CCIDCFGR_CFEN_Msk                   /*!< CID filtering enable of the channel x */
#define DMA_CCIDCFGR_SEMEN_Pos          (1U)
#define DMA_CCIDCFGR_SEMEN_Msk          (0x1UL << DMA_CCIDCFGR_SEMEN_Pos)        /*!< 0x00000002 */
#define DMA_CCIDCFGR_SEMEN              DMA_CCIDCFGR_SEMEN_Msk                  /*!< semaphore enable mode */
#define DMA_CCIDCFGR_SCID_Pos           (4U)
#define DMA_CCIDCFGR_SCID_Msk           (0x3UL << DMA_CCIDCFGR_SCID_Pos)         /*!< 0x00000030 */
#define DMA_CCIDCFGR_SCID               DMA_CCIDCFGR_SCID_Msk                   /*!< select a static CID to the channel x */
#define DMA_CCIDCFGR_WLISTCID0_Pos      (16U)
#define DMA_CCIDCFGR_WLISTCID0_Msk      (0x1UL << DMA_CCIDCFGR_WLISTCID0_Pos)    /*!< 0x00010000 */
#define DMA_CCIDCFGR_WLISTCID0          DMA_CCIDCFGR_WLISTCID0_Msk              /*!< white-listed CID0 in the CID allocation pool (of the channel x in semaphore mode) */
#define DMA_CCIDCFGR_WLISTCID1_Pos      (17U)
#define DMA_CCIDCFGR_WLISTCID1_Msk      (0x1UL << DMA_CCIDCFGR_WLISTCID1_Pos)    /*!< 0x00020000 */
#define DMA_CCIDCFGR_WLISTCID1          DMA_CCIDCFGR_WLISTCID1_Msk              /*!< white-listed CID1 in the CID allocation pool (of the channel x in semaphore mode) */
#define DMA_CCIDCFGR_WLISTCID2_Pos      (18U)
#define DMA_CCIDCFGR_WLISTCID2_Msk      (0x1UL << DMA_CCIDCFGR_WLISTCID2_Pos)    /*!< 0x00040000 */
#define DMA_CCIDCFGR_WLISTCID2          DMA_CCIDCFGR_WLISTCID2_Msk              /*!< white-listed CID2 in the CID allocation pool (of the channel x in semaphore mode) */

#define DMA_CCIDCFGR_WLISTCID_CURRENT   ((0x1UL << RIF_CID_CPU1_CA35) << DMA_CCIDCFGR_WLISTCID0_Pos)

/*******************  Bit definition for DMA_CSEMCR register  *******************/
#define DMA_CSEMCR_SEMMUTEX_Pos       (0U)
#define DMA_CSEMCR_SEMMUTEX_Msk       (0x1UL << DMA_CSEMCR_SEMMUTEX_Pos)       /*!< 0x00000001 */
#define DMA_CSEMCR_SEMMUTEX           DMA_CSEMCR_SEMMUTEX_Msk                 /*!< mutex for the CID allocation of the channel x */
#define DMA_CSEMCR_SEMCCID_Pos        (4U)
#define DMA_CSEMCR_SEMCCID_Msk        (0x3UL << DMA_CSEMCR_SEMCCID_Pos)         /*!< 0x00000030 */
#define DMA_CSEMCR_SEMCCID            DMA_CSEMCR_SEMCCID_Msk                   /*!< current CID allocated to the channel x */
#define DMA_CSEMCR_SEMCCID_CID1       (RIF_CID_CPU1_CA35 << DMA_CSEMCR_SEMCCID_Pos)
#define DMA_CSEMCR_SEMCCID_CID2       (RIF_CID_CPU2_CM33 << DMA_CSEMCR_SEMCCID_Pos)
#define DMA_CSEMCR_SEMCCID_CID3       (RIF_CID_CPU3_CM0  << DMA_CSEMCR_SEMCCID_Pos)
#define DMA_CSEMCR_SEMCCID_CURRENT    DMA_CSEMCR_SEMCCID_CID1

