STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231axx_ca35.h
/*******************  Bits definition for IAC_ICR0 register *******************/
#define IAC_ICR0_IAF0_Pos             (0U)
#define IAC_ICR0_IAF0_Msk             (0x1UL << IAC_ICR0_IAF0_Pos)               /*!< 0x00000001 */
#define IAC_ICR0_IAF0                 IAC_ICR0_IAF0_Msk
#define IAC_ICR0_IAF1_Pos             (1U)
#define IAC_ICR0_IAF1_Msk             (0x1UL << IAC_ICR0_IAF1_Pos)               /*!< 0x00000002 */
#define IAC_ICR0_IAF1                 IAC_ICR0_IAF1_Msk
#define IAC_ICR0_IAF2_Pos             (2U)
#define IAC_ICR0_IAF2_Msk             (0x1UL << IAC_ICR0_IAF2_Pos)               /*!< 0x00000004 */
#define IAC_ICR0_IAF2                 IAC_ICR0_IAF2_Msk
#define IAC_ICR0_IAF3_Pos             (3U)
#define IAC_ICR0_IAF3_Msk             (0x1UL << IAC_ICR0_IAF3_Pos)               /*!< 0x00000008 */
#define IAC_ICR0_IAF3                 IAC_ICR0_IAF3_Msk
#define IAC_ICR0_IAF4_Pos             (4U)
#define IAC_ICR0_IAF4_Msk             (0x1UL << IAC_ICR0_IAF4_Pos)               /*!< 0x00000010 */
#define IAC_ICR0_IAF4                 IAC_ICR0_IAF4_Msk
#define IAC_ICR0_IAF5_Pos             (5U)
#define IAC_ICR0_IAF5_Msk             (0x1UL << IAC_ICR0_IAF5_Pos)               /*!< 0x00000020 */
#define IAC_ICR0_IAF5                 IAC_ICR0_IAF5_Msk
#define IAC_ICR0_IAF6_Pos             (6U)
#define IAC_ICR0_IAF6_Msk             (0x1UL << IAC_ICR0_IAF6_Pos)               /*!< 0x00000040 */
#define IAC_ICR0_IAF6                 IAC_ICR0_IAF6_Msk
#define IAC_ICR0_IAF7_Pos             (7U)
#define IAC_ICR0_IAF7_Msk             (0x1UL << IAC_ICR0_IAF7_Pos)               /*!< 0x00000080 */
#define IAC_ICR0_IAF7                 IAC_ICR0_IAF7_Msk
#define IAC_ICR0_IAF8_Pos             (8U)
#define IAC_ICR0_IAF8_Msk             (0x1UL << IAC_ICR0_IAF8_Pos)               /*!< 0x00000100 */
#define IAC_ICR0_IAF8                 IAC_ICR0_IAF8_Msk
#define IAC_ICR0_IAF9_Pos             (9U)
#define IAC_ICR0_IAF9_Msk             (0x1UL << IAC_ICR0_IAF9_Pos)               /*!< 0x00000200 */
#define IAC_ICR0_IAF9                 IAC_ICR0_IAF9_Msk
#define IAC_ICR0_IAF10_Pos            (10U)
#define IAC_ICR0_IAF10_Msk            (0x1UL << IAC_ICR0_IAF10_Pos)              /*!< 0x00000400 */
#define IAC_ICR0_IAF10                IAC_ICR0_IAF10_Msk
#define IAC_ICR0_IAF11_Pos            (11U)
#define IAC_ICR0_IAF11_Msk            (0x1UL << IAC_ICR0_IAF11_Pos)              /*!< 0x00000800 */
#define IAC_ICR0_IAF11                IAC_ICR0_IAF11_Msk
#define IAC_ICR0_IAF12_Pos            (12U)
#define IAC_ICR0_IAF12_Msk            (0x1UL << IAC_ICR0_IAF12_Pos)              /*!< 0x00001000 */
#define IAC_ICR0_IAF12                IAC_ICR0_IAF12_Msk
#define IAC_ICR0_IAF13_Pos            (13U)
#define IAC_ICR0_IAF13_Msk            (0x1UL << IAC_ICR0_IAF13_Pos)              /*!< 0x00002000 */
#define IAC_ICR0_IAF13                IAC_ICR0_IAF13_Msk
#define IAC_ICR0_IAF14_Pos            (14U)
#define IAC_ICR0_IAF14_Msk            (0x1UL << IAC_ICR0_IAF14_Pos)              /*!< 0x00004000 */
#define IAC_ICR0_IAF14                IAC_ICR0_IAF14_Msk
#define IAC_ICR0_IAF15_Pos            (15U)
#define IAC_ICR0_IAF15_Msk            (0x1UL << IAC_ICR0_IAF15_Pos)              /*!< 0x00008000 */
#define IAC_ICR0_IAF15                IAC_ICR0_IAF15_Msk
#define IAC_ICR0_IAF16_Pos            (16U)
#define IAC_ICR0_IAF16_Msk            (0x1UL << IAC_ICR0_IAF16_Pos)              /*!< 0x00010000 */
#define IAC_ICR0_IAF16                IAC_ICR0_IAF16_Msk
#define IAC_ICR0_IAF17_Pos            (17U)
#define IAC_ICR0_IAF17_Msk            (0x1UL << IAC_ICR0_IAF17_Pos)              /*!< 0x00020000 */
#define IAC_ICR0_IAF17                IAC_ICR0_IAF17_Msk
#define IAC_ICR0_IAF18_Pos            (18U)
#define IAC_ICR0_IAF18_Msk            (0x1UL << IAC_ICR0_IAF18_Pos)              /*!< 0x00040000 */
#define IAC_ICR0_IAF18                IAC_ICR0_IAF18_Msk
#define IAC_ICR0_IAF19_Pos            (19U)
#define IAC_ICR0_IAF19_Msk            (0x1UL << IAC_ICR0_IAF19_Pos)              /*!< 0x00080000 */
#define IAC_ICR0_IAF19                IAC_ICR0_IAF19_Msk
#define IAC_ICR0_IAF20_Pos            (20U)
#define IAC_ICR0_IAF20_Msk            (0x1UL << IAC_ICR0_IAF20_Pos)              /*!< 0x00100000 */
#define IAC_ICR0_IAF20                IAC_ICR0_IAF20_Msk
#define IAC_ICR0_IAF21_Pos            (21U)
#define IAC_ICR0_IAF21_Msk            (0x1UL << IAC_ICR0_IAF21_Pos)              /*!< 0x00200000 */
#define IAC_ICR0_IAF21                IAC_ICR0_IAF21_Msk
#define IAC_ICR0_IAF22_Pos            (22U)
#define IAC_ICR0_IAF22_Msk            (0x1UL << IAC_ICR0_IAF22_Pos)              /*!< 0x00400000 */
#define IAC_ICR0_IAF22                IAC_ICR0_IAF22_Msk
#define IAC_ICR0_IAF23_Pos            (23U)
#define IAC_ICR0_IAF23_Msk            (0x1UL << IAC_ICR0_IAF23_Pos)              /*!< 0x00800000 */
#define IAC_ICR0_IAF23                IAC_ICR0_IAF23_Msk
#define IAC_ICR0_IAF24_Pos            (24U)
#define IAC_ICR0_IAF24_Msk            (0x1UL << IAC_ICR0_IAF24_Pos)              /*!< 0x01000000 */
#define IAC_ICR0_IAF24                IAC_ICR0_IAF24_Msk
#define IAC_ICR0_IAF25_Pos            (25U)
#define IAC_ICR0_IAF25_Msk            (0x1UL << IAC_ICR0_IAF25_Pos)              /*!< 0x02000000 */
#define IAC_ICR0_IAF25                IAC_ICR0_IAF25_Msk
#define IAC_ICR0_IAF26_Pos            (26U)
#define IAC_ICR0_IAF26_Msk            (0x1UL << IAC_ICR0_IAF26_Pos)              /*!< 0x04000000 */
#define IAC_ICR0_IAF26                IAC_ICR0_IAF26_Msk
#define IAC_ICR0_IAF27_Pos            (27U)
#define IAC_ICR0_IAF27_Msk            (0x1UL << IAC_ICR0_IAF27_Pos)              /*!< 0x08000000 */
#define IAC_ICR0_IAF27                IAC_ICR0_IAF27_Msk
#define IAC_ICR0_IAF28_Pos            (28U)
#define IAC_ICR0_IAF28_Msk            (0x1UL << IAC_ICR0_IAF28_Pos)              /*!< 0x10000000 */
#define IAC_ICR0_IAF28                IAC_ICR0_IAF28_Msk
#define IAC_ICR0_IAF29_Pos            (29U)
#define IAC_ICR0_IAF29_Msk            (0x1UL << IAC_ICR0_IAF29_Pos)              /*!< 0x20000000 */
#define IAC_ICR0_IAF29                IAC_ICR0_IAF29_Msk
#define IAC_ICR0_IAF30_Pos            (30U)
#define IAC_ICR0_IAF30_Msk            (0x1UL << IAC_ICR0_IAF30_Pos)              /*!< 0x40000000 */
#define IAC_ICR0_IAF30                IAC_ICR0_IAF30_Msk
#define IAC_ICR0_IAF31_Pos            (31U)
#define IAC_ICR0_IAF31_Msk            (0x1UL << IAC_ICR0_IAF31_Pos)              /*!< 0x80000000 */
#define IAC_ICR0_IAF31                IAC_ICR0_IAF31_Msk

