STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231axx_ca35.h
/******************  Bit definition for SERC_ICR0 register  *******************/
#define SERC_ICR0_PDRC0_Pos          (0U)
#define SERC_ICR0_PDRC0_Msk          (0x1UL << SERC_ICR0_PDRC0_Pos)     /*!< 0x00000001 */
#define SERC_ICR0_PDRC0              SERC_ICR0_PDRC0_Msk
#define SERC_ICR0_PDRC1_Pos          (1U)
#define SERC_ICR0_PDRC1_Msk          (0x1UL << SERC_ICR0_PDRC1_Pos)     /*!< 0x00000002 */
#define SERC_ICR0_PDRC1              SERC_ICR0_PDRC1_Msk
#define SERC_ICR0_PDRC2_Pos          (2U)
#define SERC_ICR0_PDRC2_Msk          (0x1UL << SERC_ICR0_PDRC2_Pos)     /*!< 0x00000004 */
#define SERC_ICR0_PDRC2              SERC_ICR0_PDRC2_Msk
#define SERC_ICR0_PDRC3_Pos          (3U)
#define SERC_ICR0_PDRC3_Msk          (0x1UL << SERC_ICR0_PDRC3_Pos)     /*!< 0x00000008 */
#define SERC_ICR0_PDRC3              SERC_ICR0_PDRC3_Msk
#define SERC_ICR0_PDRC4_Pos          (4U)
#define SERC_ICR0_PDRC4_Msk          (0x1UL << SERC_ICR0_PDRC4_Pos)     /*!< 0x00000010 */
#define SERC_ICR0_PDRC4              SERC_ICR0_PDRC4_Msk
#define SERC_ICR0_PDRC5_Pos          (5U)
#define SERC_ICR0_PDRC5_Msk          (0x1UL << SERC_ICR0_PDRC5_Pos)     /*!< 0x00000020 */
#define SERC_ICR0_PDRC5              SERC_ICR0_PDRC5_Msk
#define SERC_ICR0_PDRC6_Pos          (6U)
#define SERC_ICR0_PDRC6_Msk          (0x1UL << SERC_ICR0_PDRC6_Pos)     /*!< 0x00000040 */
#define SERC_ICR0_PDRC6              SERC_ICR0_PDRC6_Msk
#define SERC_ICR0_PDRC7_Pos          (7U)
#define SERC_ICR0_PDRC7_Msk          (0x1UL << SERC_ICR0_PDRC7_Pos)     /*!< 0x00000080 */
#define SERC_ICR0_PDRC7              SERC_ICR0_PDRC7_Msk
#define SERC_ICR0_PDRC8_Pos          (8U)
#define SERC_ICR0_PDRC8_Msk          (0x1UL << SERC_ICR0_PDRC8_Pos)     /*!< 0x00000100 */
#define SERC_ICR0_PDRC8              SERC_ICR0_PDRC8_Msk
#define SERC_ICR0_PDRC9_Pos          (9U)
#define SERC_ICR0_PDRC9_Msk          (0x1UL << SERC_ICR0_PDRC9_Pos)     /*!< 0x00000200 */
#define SERC_ICR0_PDRC9              SERC_ICR0_PDRC9_Msk
#define SERC_ICR0_PDRC10_Pos         (10U)
#define SERC_ICR0_PDRC10_Msk         (0x1UL << SERC_ICR0_PDRC10_Pos)    /*!< 0x00000400 */
#define SERC_ICR0_PDRC10             SERC_ICR0_PDRC10_Msk
#define SERC_ICR0_PDRC11_Pos         (11U)
#define SERC_ICR0_PDRC11_Msk         (0x1UL << SERC_ICR0_PDRC11_Pos)    /*!< 0x00000800 */
#define SERC_ICR0_PDRC11             SERC_ICR0_PDRC11_Msk
#define SERC_ICR0_PDRC12_Pos         (12U)
#define SERC_ICR0_PDRC12_Msk         (0x1UL << SERC_ICR0_PDRC12_Pos)    /*!< 0x00001000 */
#define SERC_ICR0_PDRC12             SERC_ICR0_PDRC12_Msk
#define SERC_ICR0_PDRC13_Pos         (13U)
#define SERC_ICR0_PDRC13_Msk         (0x1UL << SERC_ICR0_PDRC13_Pos)    /*!< 0x00002000 */
#define SERC_ICR0_PDRC13             SERC_ICR0_PDRC13_Msk
#define SERC_ICR0_PDRC14_Pos         (14U)
#define SERC_ICR0_PDRC14_Msk         (0x1UL << SERC_ICR0_PDRC14_Pos)    /*!< 0x00004000 */
#define SERC_ICR0_PDRC14             SERC_ICR0_PDRC14_Msk
#define SERC_ICR0_PDRC15_Pos         (15U)
#define SERC_ICR0_PDRC15_Msk         (0x1UL << SERC_ICR0_PDRC15_Pos)    /*!< 0x00008000 */
#define SERC_ICR0_PDRC15             SERC_ICR0_PDRC15_Msk
#define SERC_ICR0_PDRC16_Pos         (16U)
#define SERC_ICR0_PDRC16_Msk         (0x1UL << SERC_ICR0_PDRC16_Pos)    /*!< 0x00010000 */
#define SERC_ICR0_PDRC16             SERC_ICR0_PDRC16_Msk
#define SERC_ICR0_PDRC17_Pos         (17U)
#define SERC_ICR0_PDRC17_Msk         (0x1UL << SERC_ICR0_PDRC17_Pos)    /*!< 0x00020000 */
#define SERC_ICR0_PDRC17             SERC_ICR0_PDRC17_Msk
#define SERC_ICR0_PDRC18_Pos         (18U)
#define SERC_ICR0_PDRC18_Msk         (0x1UL << SERC_ICR0_PDRC18_Pos)    /*!< 0x00040000 */
#define SERC_ICR0_PDRC18             SERC_ICR0_PDRC18_Msk
#define SERC_ICR0_PDRC19_Pos         (19U)
#define SERC_ICR0_PDRC19_Msk         (0x1UL << SERC_ICR0_PDRC19_Pos)    /*!< 0x00080000 */
#define SERC_ICR0_PDRC19             SERC_ICR0_PDRC19_Msk
#define SERC_ICR0_PDRC20_Pos         (20U)
#define SERC_ICR0_PDRC20_Msk         (0x1UL << SERC_ICR0_PDRC20_Pos)    /*!< 0x00100000 */
#define SERC_ICR0_PDRC20             SERC_ICR0_PDRC20_Msk
#define SERC_ICR0_PDRC21_Pos         (21U)
#define SERC_ICR0_PDRC21_Msk         (0x1UL << SERC_ICR0_PDRC21_Pos)    /*!< 0x00200000 */
#define SERC_ICR0_PDRC21             SERC_ICR0_PDRC21_Msk
#define SERC_ICR0_PDRC22_Pos         (22U)
#define SERC_ICR0_PDRC22_Msk         (0x1UL << SERC_ICR0_PDRC22_Pos)    /*!< 0x00400000 */
#define SERC_ICR0_PDRC22             SERC_ICR0_PDRC22_Msk
#define SERC_ICR0_PDRC23_Pos         (23U)
#define SERC_ICR0_PDRC23_Msk         (0x1UL << SERC_ICR0_PDRC23_Pos)    /*!< 0x00800000 */
#define SERC_ICR0_PDRC23             SERC_ICR0_PDRC23_Msk
#define SERC_ICR0_PDRC24_Pos         (24U)
#define SERC_ICR0_PDRC24_Msk         (0x1UL << SERC_ICR0_PDRC24_Pos)    /*!< 0x01000000 */
#define SERC_ICR0_PDRC24             SERC_ICR0_PDRC24_Msk
#define SERC_ICR0_PDRC25_Pos         (25U)
#define SERC_ICR0_PDRC25_Msk         (0x1UL << SERC_ICR0_PDRC25_Pos)    /*!< 0x02000000 */
#define SERC_ICR0_PDRC25             SERC_ICR0_PDRC25_Msk
#define SERC_ICR0_PDRC26_Pos         (26U)
#define SERC_ICR0_PDRC26_Msk         (0x1UL << SERC_ICR0_PDRC26_Pos)    /*!< 0x04000000 */
#define SERC_ICR0_PDRC26             SERC_ICR0_PDRC26_Msk
#define SERC_ICR0_PDRC27_Pos         (27U)
#define SERC_ICR0_PDRC27_Msk         (0x1UL << SERC_ICR0_PDRC27_Pos)    /*!< 0x08000000 */
#define SERC_ICR0_PDRC27             SERC_ICR0_PDRC27_Msk
#define SERC_ICR0_PDRC28_Pos         (28U)
#define SERC_ICR0_PDRC28_Msk         (0x1UL << SERC_ICR0_PDRC28_Pos)    /*!< 0x10000000 */
#define SERC_ICR0_PDRC28             SERC_ICR0_PDRC28_Msk
#define SERC_ICR0_PDRC29_Pos         (29U)
#define SERC_ICR0_PDRC29_Msk         (0x1UL << SERC_ICR0_PDRC29_Pos)    /*!< 0x20000000 */
#define SERC_ICR0_PDRC29             SERC_ICR0_PDRC29_Msk
#define SERC_ICR0_PDRC30_Pos         (30U)
#define SERC_ICR0_PDRC30_Msk         (0x1UL << SERC_ICR0_PDRC30_Pos)    /*!< 0x40000000 */
#define SERC_ICR0_PDRC30             SERC_ICR0_PDRC30_Msk
#define SERC_ICR0_PDRC31_Pos         (31U)
#define SERC_ICR0_PDRC31_Msk         (0x1UL << SERC_ICR0_PDRC31_Pos)    /*!< 0x80000000 */
#define SERC_ICR0_PDRC31             SERC_ICR0_PDRC31_Msk

/******************  Bit definition for SERC_ICR1 register  *******************/
#define SERC_ICR1_PDRC32_Pos         (0U)
#define SERC_ICR1_PDRC32_Msk         (0x1UL << SERC_ICR1_PDRC32_Pos)    /*!< 0x00000001 */
#define SERC_ICR1_PDRC32             SERC_ICR1_PDRC32_Msk
#define SERC_ICR1_PDRC33_Pos         (1U)
#define SERC_ICR1_PDRC33_Msk         (0x1UL << SERC_ICR1_PDRC33_Pos)    /*!< 0x00000002 */
#define SERC_ICR1_PDRC33             SERC_ICR1_PDRC33_Msk
#define SERC_ICR1_PDRC34_Pos         (2U)
#define SERC_ICR1_PDRC34_Msk         (0x1UL << SERC_ICR1_PDRC34_Pos)    /*!< 0x00000004 */
#define SERC_ICR1_PDRC34             SERC_ICR1_PDRC34_Msk
#define SERC_ICR1_PDRC35_Pos         (3U)
#define SERC_ICR1_PDRC35_Msk         (0x1UL << SERC_ICR1_PDRC35_Pos)    /*!< 0x00000008 */
#define SERC_ICR1_PDRC35             SERC_ICR1_PDRC35_Msk
#define SERC_ICR1_PDRC36_Pos         (4U)
#define SERC_ICR1_PDRC36_Msk         (0x1UL << SERC_ICR1_PDRC36_Pos)    /*!< 0x00000010 */
#define SERC_ICR1_PDRC36             SERC_ICR1_PDRC36_Msk
#define SERC_ICR1_PDRC37_Pos         (5U)
#define SERC_ICR1_PDRC37_Msk         (0x1UL << SERC_ICR1_PDRC37_Pos)    /*!< 0x00000020 */
#define SERC_ICR1_PDRC37             SERC_ICR1_PDRC37_Msk
#define SERC_ICR1_PDRC38_Pos         (6U)
#define SERC_ICR1_PDRC38_Msk         (0x1UL << SERC_ICR1_PDRC38_Pos)    /*!< 0x00000040 */
#define SERC_ICR1_PDRC38             SERC_ICR1_PDRC38_Msk
#define SERC_ICR1_PDRC39_Pos         (7U)
#define SERC_ICR1_PDRC39_Msk         (0x1UL << SERC_ICR1_PDRC39_Pos)    /*!< 0x00000080 */
#define SERC_ICR1_PDRC39             SERC_ICR1_PDRC39_Msk
#define SERC_ICR1_PDRC40_Pos         (8U)
#define SERC_ICR1_PDRC40_Msk         (0x1UL << SERC_ICR1_PDRC40_Pos)    /*!< 0x00000100 */
#define SERC_ICR1_PDRC40             SERC_ICR1_PDRC40_Msk
#define SERC_ICR1_PDRC41_Pos         (9U)
#define SERC_ICR1_PDRC41_Msk         (0x1UL << SERC_ICR1_PDRC41_Pos)    /*!< 0x00000200 */
#define SERC_ICR1_PDRC41             SERC_ICR1_PDRC41_Msk
#define SERC_ICR1_PDRC42_Pos         (10U)
#define SERC_ICR1_PDRC42_Msk         (0x1UL << SERC_ICR1_PDRC42_Pos)    /*!< 0x00000400 */
#define SERC_ICR1_PDRC42             SERC_ICR1_PDRC42_Msk
#define SERC_ICR1_PDRC43_Pos         (11U)
#define SERC_ICR1_PDRC43_Msk         (0x1UL << SERC_ICR1_PDRC43_Pos)    /*!< 0x00000800 */
#define SERC_ICR1_PDRC43             SERC_ICR1_PDRC43_Msk
#define SERC_ICR1_PDRC44_Pos         (12U)
#define SERC_ICR1_PDRC44_Msk         (0x1UL << SERC_ICR1_PDRC44_Pos)    /*!< 0x00001000 */
#define SERC_ICR1_PDRC44             SERC_ICR1_PDRC44_Msk
#define SERC_ICR1_PDRC45_Pos         (13U)
#define SERC_ICR1_PDRC45_Msk         (0x1UL << SERC_ICR1_PDRC45_Pos)    /*!< 0x00002000 */
#define SERC_ICR1_PDRC45             SERC_ICR1_PDRC45_Msk
#define SERC_ICR1_PDRC46_Pos         (14U)
#define SERC_ICR1_PDRC46_Msk         (0x1UL << SERC_ICR1_PDRC46_Pos)    /*!< 0x00004000 */
#define SERC_ICR1_PDRC46             SERC_ICR1_PDRC46_Msk
#define SERC_ICR1_PDRC47_Pos         (15U)
#define SERC_ICR1_PDRC47_Msk         (0x1UL << SERC_ICR1_PDRC47_Pos)    /*!< 0x00008000 */
#define SERC_ICR1_PDRC47             SERC_ICR1_PDRC47_Msk
#define SERC_ICR1_PDRC48_Pos         (16U)
#define SERC_ICR1_PDRC48_Msk         (0x1UL << SERC_ICR1_PDRC48_Pos)    /*!< 0x00010000 */
#define SERC_ICR1_PDRC48             SERC_ICR1_PDRC48_Msk
#define SERC_ICR1_PDRC49_Pos         (17U)
#define SERC_ICR1_PDRC49_Msk         (0x1UL << SERC_ICR1_PDRC49_Pos)    /*!< 0x00020000 */
#define SERC_ICR1_PDRC49             SERC_ICR1_PDRC49_Msk
#define SERC_ICR1_PDRC50_Pos         (18U)
#define SERC_ICR1_PDRC50_Msk         (0x1UL << SERC_ICR1_PDRC50_Pos)    /*!< 0x00040000 */
#define SERC_ICR1_PDRC50             SERC_ICR1_PDRC50_Msk
#define SERC_ICR1_PDRC51_Pos         (19U)
#define SERC_ICR1_PDRC51_Msk         (0x1UL << SERC_ICR1_PDRC51_Pos)    /*!< 0x00080000 */
#define SERC_ICR1_PDRC51             SERC_ICR1_PDRC51_Msk
#define SERC_ICR1_PDRC52_Pos         (20U)
#define SERC_ICR1_PDRC52_Msk         (0x1UL << SERC_ICR1_PDRC52_Pos)    /*!< 0x00100000 */
#define SERC_ICR1_PDRC52             SERC_ICR1_PDRC52_Msk
#define SERC_ICR1_PDRC53_Pos         (21U)
#define SERC_ICR1_PDRC53_Msk         (0x1UL << SERC_ICR1_PDRC53_Pos)    /*!< 0x00200000 */
#define SERC_ICR1_PDRC53             SERC_ICR1_PDRC53_Msk
#define SERC_ICR1_PDRC54_Pos         (22U)
#define SERC_ICR1_PDRC54_Msk         (0x1UL << SERC_ICR1_PDRC54_Pos)    /*!< 0x00400000 */
#define SERC_ICR1_PDRC54             SERC_ICR1_PDRC54_Msk
#define SERC_ICR1_PDRC55_Pos         (23U)
#define SERC_ICR1_PDRC55_Msk         (0x1UL << SERC_ICR1_PDRC55_Pos)    /*!< 0x00800000 */
#define SERC_ICR1_PDRC55             SERC_ICR1_PDRC55_Msk
#define SERC_ICR1_PDRC56_Pos         (24U)
#define SERC_ICR1_PDRC56_Msk         (0x1UL << SERC_ICR1_PDRC56_Pos)    /*!< 0x01000000 */
#define SERC_ICR1_PDRC56             SERC_ICR1_PDRC56_Msk
#define SERC_ICR1_PDRC57_Pos         (25U)
#define SERC_ICR1_PDRC57_Msk         (0x1UL << SERC_ICR1_PDRC57_Pos)    /*!< 0x02000000 */
#define SERC_ICR1_PDRC57             SERC_ICR1_PDRC57_Msk
#define SERC_ICR1_PDRC58_Pos         (26U)
#define SERC_ICR1_PDRC58_Msk         (0x1UL << SERC_ICR1_PDRC58_Pos)    /*!< 0x04000000 */
#define SERC_ICR1_PDRC58             SERC_ICR1_PDRC58_Msk
#define SERC_ICR1_PDRC59_Pos         (27U)
#define SERC_ICR1_PDRC59_Msk         (0x1UL << SERC_ICR1_PDRC59_Pos)    /*!< 0x08000000 */
#define SERC_ICR1_PDRC59             SERC_ICR1_PDRC59_Msk
#define SERC_ICR1_PDRC60_Pos         (28U)
#define SERC_ICR1_PDRC60_Msk         (0x1UL << SERC_ICR1_PDRC60_Pos)    /*!< 0x10000000 */
#define SERC_ICR1_PDRC60             SERC_ICR1_PDRC60_Msk
#define SERC_ICR1_PDRC61_Pos         (29U)
#define SERC_ICR1_PDRC61_Msk         (0x1UL << SERC_ICR1_PDRC61_Pos)    /*!< 0x20000000 */
#define SERC_ICR1_PDRC61             SERC_ICR1_PDRC61_Msk
#define SERC_ICR1_PDRC62_Pos         (30U)
#define SERC_ICR1_PDRC62_Msk         (0x1UL << SERC_ICR1_PDRC62_Pos)    /*!< 0x40000000 */
#define SERC_ICR1_PDRC62             SERC_ICR1_PDRC62_Msk
#define SERC_ICR1_PDRC63_Pos         (31U)
#define SERC_ICR1_PDRC63_Msk         (0x1UL << SERC_ICR1_PDRC63_Pos)    /*!< 0x80000000 */
#define SERC_ICR1_PDRC63             SERC_ICR1_PDRC63_Msk

/******************  Bit definition for SERC_ICR2 register  *******************/
#define SERC_ICR2_PDRC64_Pos         (0U)
#define SERC_ICR2_PDRC64_Msk         (0x1UL << SERC_ICR2_PDRC64_Pos)    /*!< 0x00000001 */
#define SERC_ICR2_PDRC64             SERC_ICR2_PDRC64_Msk
#define SERC_ICR2_PDRC65_Pos         (1U)
#define SERC_ICR2_PDRC65_Msk         (0x1UL << SERC_ICR2_PDRC65_Pos)    /*!< 0x00000002 */
#define SERC_ICR2_PDRC65             SERC_ICR2_PDRC65_Msk
#define SERC_ICR2_PDRC66_Pos         (2U)
#define SERC_ICR2_PDRC66_Msk         (0x1UL << SERC_ICR2_PDRC66_Pos)    /*!< 0x00000004 */
#define SERC_ICR2_PDRC66             SERC_ICR2_PDRC66_Msk
#define SERC_ICR2_PDRC67_Pos         (3U)
#define SERC_ICR2_PDRC67_Msk         (0x1UL << SERC_ICR2_PDRC67_Pos)    /*!< 0x00000008 */
#define SERC_ICR2_PDRC67             SERC_ICR2_PDRC67_Msk
#define SERC_ICR2_PDRC68_Pos         (4U)
#define SERC_ICR2_PDRC68_Msk         (0x1UL << SERC_ICR2_PDRC68_Pos)    /*!< 0x00000010 */
#define SERC_ICR2_PDRC68             SERC_ICR2_PDRC68_Msk
#define SERC_ICR2_PDRC69_Pos         (5U)
#define SERC_ICR2_PDRC69_Msk         (0x1UL << SERC_ICR2_PDRC69_Pos)    /*!< 0x00000020 */
#define SERC_ICR2_PDRC69             SERC_ICR2_PDRC69_Msk
#define SERC_ICR2_PDRC70_Pos         (6U)
#define SERC_ICR2_PDRC70_Msk         (0x1UL << SERC_ICR2_PDRC70_Pos)    /*!< 0x00000040 */
#define SERC_ICR2_PDRC70             SERC_ICR2_PDRC70_Msk
#define SERC_ICR2_PDRC71_Pos         (7U)
#define SERC_ICR2_PDRC71_Msk         (0x1UL << SERC_ICR2_PDRC71_Pos)    /*!< 0x00000080 */
#define SERC_ICR2_PDRC71             SERC_ICR2_PDRC71_Msk
#define SERC_ICR2_PDRC72_Pos         (8U)
#define SERC_ICR2_PDRC72_Msk         (0x1UL << SERC_ICR2_PDRC72_Pos)    /*!< 0x00000100 */
#define SERC_ICR2_PDRC72             SERC_ICR2_PDRC72_Msk
#define SERC_ICR2_PDRC73_Pos         (9U)
#define SERC_ICR2_PDRC73_Msk         (0x1UL << SERC_ICR2_PDRC73_Pos)    /*!< 0x00000200 */
#define SERC_ICR2_PDRC73             SERC_ICR2_PDRC73_Msk
#define SERC_ICR2_PDRC74_Pos         (10U)
#define SERC_ICR2_PDRC74_Msk         (0x1UL << SERC_ICR2_PDRC74_Pos)    /*!< 0x00000400 */
#define SERC_ICR2_PDRC74             SERC_ICR2_PDRC74_Msk
#define SERC_ICR2_PDRC75_Pos         (11U)
#define SERC_ICR2_PDRC75_Msk         (0x1UL << SERC_ICR2_PDRC75_Pos)    /*!< 0x00000800 */
#define SERC_ICR2_PDRC75             SERC_ICR2_PDRC75_Msk
#define SERC_ICR2_PDRC76_Pos         (12U)
#define SERC_ICR2_PDRC76_Msk         (0x1UL << SERC_ICR2_PDRC76_Pos)    /*!< 0x00001000 */
#define SERC_ICR2_PDRC76             SERC_ICR2_PDRC76_Msk
#define SERC_ICR2_PDRC77_Pos         (13U)
#define SERC_ICR2_PDRC77_Msk         (0x1UL << SERC_ICR2_PDRC77_Pos)    /*!< 0x00002000 */
#define SERC_ICR2_PDRC77             SERC_ICR2_PDRC77_Msk
#define SERC_ICR2_PDRC78_Pos         (14U)
#define SERC_ICR2_PDRC78_Msk         (0x1UL << SERC_ICR2_PDRC78_Pos)    /*!< 0x00004000 */
#define SERC_ICR2_PDRC78             SERC_ICR2_PDRC78_Msk
#define SERC_ICR2_PDRC79_Pos         (15U)
#define SERC_ICR2_PDRC79_Msk         (0x1UL << SERC_ICR2_PDRC79_Pos)    /*!< 0x00008000 */
#define SERC_ICR2_PDRC79             SERC_ICR2_PDRC79_Msk
#define SERC_ICR2_PDRC80_Pos         (16U)
#define SERC_ICR2_PDRC80_Msk         (0x1UL << SERC_ICR2_PDRC80_Pos)    /*!< 0x00010000 */
#define SERC_ICR2_PDRC80             SERC_ICR2_PDRC80_Msk
#define SERC_ICR2_PDRC81_Pos         (17U)
#define SERC_ICR2_PDRC81_Msk         (0x1UL << SERC_ICR2_PDRC81_Pos)    /*!< 0x00020000 */
#define SERC_ICR2_PDRC81             SERC_ICR2_PDRC81_Msk
#define SERC_ICR2_PDRC82_Pos         (18U)
#define SERC_ICR2_PDRC82_Msk         (0x1UL << SERC_ICR2_PDRC82_Pos)    /*!< 0x00040000 */
#define SERC_ICR2_PDRC82             SERC_ICR2_PDRC82_Msk
#define SERC_ICR2_PDRC83_Pos         (19U)
#define SERC_ICR2_PDRC83_Msk         (0x1UL << SERC_ICR2_PDRC83_Pos)    /*!< 0x00080000 */
#define SERC_ICR2_PDRC83             SERC_ICR2_PDRC83_Msk
#define SERC_ICR2_PDRC84_Pos         (20U)
#define SERC_ICR2_PDRC84_Msk         (0x1UL << SERC_ICR2_PDRC84_Pos)    /*!< 0x00100000 */
#define SERC_ICR2_PDRC84             SERC_ICR2_PDRC84_Msk
#define SERC_ICR2_PDRC85_Pos         (21U)
#define SERC_ICR2_PDRC85_Msk         (0x1UL << SERC_ICR2_PDRC85_Pos)    /*!< 0x00200000 */
#define SERC_ICR2_PDRC85             SERC_ICR2_PDRC85_Msk
#define SERC_ICR2_PDRC86_Pos         (22U)
#define SERC_ICR2_PDRC86_Msk         (0x1UL << SERC_ICR2_PDRC86_Pos)    /*!< 0x00400000 */
#define SERC_ICR2_PDRC86             SERC_ICR2_PDRC86_Msk
#define SERC_ICR2_PDRC87_Pos         (23U)
#define SERC_ICR2_PDRC87_Msk         (0x1UL << SERC_ICR2_PDRC87_Pos)    /*!< 0x00800000 */
#define SERC_ICR2_PDRC87             SERC_ICR2_PDRC87_Msk
#define SERC_ICR2_PDRC88_Pos         (24U)
#define SERC_ICR2_PDRC88_Msk         (0x1UL << SERC_ICR2_PDRC88_Pos)    /*!< 0x01000000 */
#define SERC_ICR2_PDRC88             SERC_ICR2_PDRC88_Msk
#define SERC_ICR2_PDRC89_Pos         (25U)
#define SERC_ICR2_PDRC89_Msk         (0x1UL << SERC_ICR2_PDRC89_Pos)    /*!< 0x02000000 */
#define SERC_ICR2_PDRC89             SERC_ICR2_PDRC89_Msk
#define SERC_ICR2_PDRC90_Pos         (26U)
#define SERC_ICR2_PDRC90_Msk         (0x1UL << SERC_ICR2_PDRC90_Pos)    /*!< 0x04000000 */
#define SERC_ICR2_PDRC90             SERC_ICR2_PDRC90_Msk
#define SERC_ICR2_PDRC91_Pos         (27U)
#define SERC_ICR2_PDRC91_Msk         (0x1UL << SERC_ICR2_PDRC91_Pos)    /*!< 0x08000000 */
#define SERC_ICR2_PDRC91             SERC_ICR2_PDRC91_Msk
#define SERC_ICR2_PDRC92_Pos         (28U)
#define SERC_ICR2_PDRC92_Msk         (0x1UL << SERC_ICR2_PDRC92_Pos)    /*!< 0x10000000 */
#define SERC_ICR2_PDRC92             SERC_ICR2_PDRC92_Msk
#define SERC_ICR2_PDRC93_Pos         (29U)
#define SERC_ICR2_PDRC93_Msk         (0x1UL << SERC_ICR2_PDRC93_Pos)    /*!< 0x20000000 */
#define SERC_ICR2_PDRC93             SERC_ICR2_PDRC93_Msk
#define SERC_ICR2_PDRC94_Pos         (30U)
#define SERC_ICR2_PDRC94_Msk         (0x1UL << SERC_ICR2_PDRC94_Pos)    /*!< 0x40000000 */
#define SERC_ICR2_PDRC94             SERC_ICR2_PDRC94_Msk
#define SERC_ICR2_PDRC95_Pos         (31U)
#define SERC_ICR2_PDRC95_Msk         (0x1UL << SERC_ICR2_PDRC95_Pos)    /*!< 0x80000000 */
#define SERC_ICR2_PDRC95             SERC_ICR2_PDRC95_Msk

